---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.CreateElements
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.CreateElements

Defines a resolution of a failure where Revit will add new Element(s) in place of missing one(s).